{
  "_name_or_path": "C:/Users/\ud5c8\ub300\ud604/tiny_git/onnx_model_output/kc_electra_small_unified\\",
  "architectures": [
    "ElectraForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "embedding_size": 128,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "\uc131\ucc28\ubcc4",
    "1": "\uc778\uc885/\uad6d\uc801/\uc9c0\uc5ed",
    "2": "\uc5f0\ub839",
    "3": "\uc885\uad50",
    "4": "\uc545\ud50c/\uc695\uc124",
    "5": "\uc815\uce58/\uae30\ud0c0\ud610\uc624",
    "6": "clean"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "label2id": {
    "clean": 6,
    "\uc131\ucc28\ubcc4": 0,
    "\uc545\ud50c/\uc695\uc124": 4,
    "\uc5f0\ub839": 2,
    "\uc778\uc885/\uad6d\uc801/\uc9c0\uc5ed": 1,
    "\uc815\uce58/\uae30\ud0c0\ud610\uc624": 5,
    "\uc885\uad50": 3
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 4,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "tokenizer_class": "BertTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 54343
}
